import React from 'react';
import './totalWrittenChecks.scss';
import * as local from '../../../../Shared/Assets/ar.json';

const TotalWrittenChecks = (props) => {
    console.log('props', props)
    return (
        <div className="total-written-checks-print">
            <div className="check">
                <div>شركة تساهيل للتمويل متناهي الصغر ش. م. م.</div>
                <div className="title">ايصال استلام مبلغ نقدى علي سبيل الامانه</div>
                <div>استلمت انا الموقع ادناه / نجلاء محمد فتحي محمود عفيفي</div>
                <div>بطاقه رقم قومي: ٢٧٨٠١٣٠١٦٠١٤٦٢</div>
                <div>والمقيم في: ش الموافى جوار جامع الفخرانى منزل فتحى عفيفى مركز زفتي - الغربيه</div>
                <div>من شركة تساهيل للتمويل متناهي الصغر "تساهيل"</div>
                <div>مبلغاً وقدره ٥٨٢٢٤ جنيه (فقط ثمانيه وخمسون ألف ومائتان وأربعة وعشرون جنيه مصري فقط لا غير)</div>
                <div>وذلك علي سبيل الأمانه لأقوم بسداده الي حساب رقم: ٥٢٢٩٩٤ ببنك العربي الأفريقي الدولي فرع مدينه نصر</div>
                <div>وإذا لم اقم بسداد المبلغ المذكور أكون مبددا وخائننا للأمانه واتحمل المسئوليتين المدنيه والجنائيه عن هذا
			الفعل ولا تبرأ ذمتي الا بإستلام هذا الايصال</div>
                <table>
                    <tbody>
                        <tr>
                            <td colSpan={2}>
                                <div>المستلم</div>
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <div>الاسم</div>
                            </td>
                            <td style={{width: "100px"}}></td>
                        </tr>
                    </tbody>
                </table>
            </div>


            <div className="check">
                <div>شركة تساهيل للتمويل متناهي الصغر ش. م. م.</div>
                <div className="title">ايصال استلام مبلغ نقدى علي سبيل الامانه</div>
                <div>استلمت انا الموقع ادناه / نجلاء محمد فتحي محمود عفيفي</div>
                <div>بطاقه رقم قومي: ٢٧٨٠١٣٠١٦٠١٤٦٢</div>
                <div>والمقيم في: ش الموافى جوار جامع الفخرانى منزل فتحى عفيفى مركز زفتي - الغربيه</div>
                <div>من شركة تساهيل للتمويل متناهي الصغر "تساهيل"</div>
                <div>مبلغاً وقدره ٥٨٢٢٤ جنيه (فقط ثمانيه وخمسون ألف ومائتان وأربعة وعشرون جنيه مصري فقط لا غير)</div>
                <div>وذلك علي سبيل الأمانه لأقوم بسداده الي حساب رقم: ٥٢٢٩٩٤ ببنك العربي الأفريقي الدولي فرع مدينه نصر</div>
                <div>وإذا لم اقم بسداد المبلغ المذكور أكون مبددا وخائننا للأمانه واتحمل المسئوليتين المدنيه والجنائيه عن هذا
			الفعل ولا تبرأ ذمتي الا بإستلام هذا الايصال</div>
                <table>
                    <tbody>
                        <tr>
                            <td colSpan={2}>
                                <div>المستلم</div>
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <div>الاسم</div>
                            </td>
                            <td style={{width: "100px"}}></td>
                        </tr>
                    </tbody>
                </table>
            </div>


            <div className="check">
                <div>شركة تساهيل للتمويل متناهي الصغر ش. م. م.</div>
                <div className="title">ايصال استلام مبلغ نقدى علي سبيل الامانه</div>
                <div>استلمت انا الموقع ادناه / نجلاء محمد فتحي محمود عفيفي</div>
                <div>بطاقه رقم قومي: ٢٧٨٠١٣٠١٦٠١٤٦٢</div>
                <div>والمقيم في: ش الموافى جوار جامع الفخرانى منزل فتحى عفيفى مركز زفتي - الغربيه</div>
                <div>من شركة تساهيل للتمويل متناهي الصغر "تساهيل"</div>
                <div>مبلغاً وقدره ٥٨٢٢٤ جنيه (فقط ثمانيه وخمسون ألف ومائتان وأربعة وعشرون جنيه مصري فقط لا غير)</div>
                <div>وذلك علي سبيل الأمانه لأقوم بسداده الي حساب رقم: ٥٢٢٩٩٤ ببنك العربي الأفريقي الدولي فرع مدينه نصر</div>
                <div>وإذا لم اقم بسداد المبلغ المذكور أكون مبددا وخائننا للأمانه واتحمل المسئوليتين المدنيه والجنائيه عن هذا
			الفعل ولا تبرأ ذمتي الا بإستلام هذا الايصال</div>
                <table>
                    <tbody>
                        <tr>
                            <td colSpan={2}>
                                <div>المستلم</div>
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <div>الاسم</div>
                            </td>
                            <td style={{width: "100px"}}></td>
                        </tr>
                    </tbody>
                </table>
            </div>
        </div>
    )
}

export default TotalWrittenChecks;