import React, { Component } from 'react'
import './clearancePaper.scss'
export default class ClearancePaper extends Component {

    render() {
        return (
            <div className = 'clearance-paper-print'>
                مخـــــالصـــة
                الساده / بنك مصر 
                تحيه طيبه وبعد ،،،،،
                الموضوع : التمويل السابق منحه للعميل / مني مامون زكي مسعود .
                بالاشاره الي الموضوع بعاليه والي طلب العميل / مني مامون زكي مسعود ، بشأن طلب موافاتكم بما يفيد موقف العميل طرفنا في تاريخه .
                نتشرف بالافاده ان العميل / مني مامون زكي مسعود ، قد قام بسداد كافه المديونيات المستحقه عليه والناتجه من التمويل السابق منحه بتاريخ 24/07/2019 .
                وكذا انهاء كافه الضمانات الشخصيه السابق صدورها منه لصالح شركتنا لعملاء اخرين وذلك باجمالي مبلغ وقدره 50000 جنيه 
                فقط خمسون الف جنيه مصري لاغير .
                ولا يستحق لشركتنا قبل العميل / مني مامون زكي مسعود ، ايه مديونيات او مستحقات حتي تاريخ هذا الخطاب .

                تحريرا في 13/10/2020  
                وتفضلوا بقبول فائق الاحترام ،،،،،،،
                شركه تساهيل للتمويل متناهي الصغر 


            </div>
        )
    }
}
