import React from "react";

import { Header } from "../pdfTemplateCommon/header";
import { PromissoryNoteProps } from "./types";

export const PromissoryNote = ({ noteKind }: PromissoryNoteProps) => (
  <>
    <div className="contract-container" dir="rtl" lang="ar">
      <Header
        title={`سند لأمر ( ${noteKind} )`}
        showCurrentUser={false}
        showCurrentTime={false}
      />
      <p>تاريخ الاصدار :</p>
      <p>مكان الاصدار:</p>
      <p>تاريخ الاستحقاق :</p>
      <p>المبلغ : </p>
      <p>
        نتعهد نحن الموقعين ادناه تعهداً نهائيا وبدون اى قيد او شرط بأن ندفع فى
        تاريخ الاستحقاق لأمر واذن شركة تساهيل للتمويل مبلغ وقدره
        ............................................................................
        على ان يتم الوفاء بمبلغ السند بحساب الشركة رقم ................... بنك
        ................. فرع ........................ والقيمة وصلتنا نقداً
        ويستحق علينا عوائد من تاريخ تحرير السند وحتى تاريخ السداد بواقع .... %
        سنوياً ، كما يستحق علينا عوائد تأخير بواقع ......... % علاوة على سعر
        العائد المطبق من تاريخ الاستحقاق حتى تمام السداد وذلك بدون حاجة الى
        تنبيه او انذار.
      </p>
      <p>
        ويحق لحامل هذا السند الرجوع علينا بدون مصروفات او اخطار او عمل احتجاج
        لعدم الوفاء، ونفوض الشركة فى ملء أية بيانات او مبالغ طالما ان السند موقع
        منا ونلتزم بما ورد فى السند ولا يجوز لنا الاعتراض.
      </p>
      <p>
        والدفع والتقاضى يكون امام محاكم ( الجيزه ) على اختلاف درجاتها وانواعها.
      </p>
      <p>{noteKind === 'شركات'?  'الشركة :' :   'الاسم :' }</p>
      {noteKind ==='شركات' && <p>من له حق التوقيع عن الشركة :</p>}
      <p>الصفة : </p>
      <p>بطاقة الرقم القومى :</p>
      <p>العنوان:</p>
      <p>التوقيع :</p>
    </div>
  </>
);
