import React from 'react'
import Tafgeet from 'tafgeetjs'
import { Header } from '../../../../Shared/Components/pdfTemplates/pdfTemplateCommon/header'
import {
  numbersToArabic,
  timeToArabicDate,
} from '../../../../Shared/Services/utils'

import { SolidarityGuaranteeProps } from './types'

export const SolidarityGuarantee = ({
  application,
  person,
}: SolidarityGuaranteeProps) => (
  <>
    <div className="contract-container m-0 p-0" dir="rtl" lang="ar">
      <Header
        title="كفالة تضامنية "
        showCurrentUser={false}
        showCurrentTime={false}
        sme
      />
      <p className="my-0 py-0">
        التاريخ : {timeToArabicDate(application.creationDate, false)}{' '}
      </p>
      <p>
        بالاشارة الى التسهيلات الائتمانية الممنوحة من شركة تساهيل للتمويل متناهي
        الصغر الى {application.customer?.customerName} البالغ قيمتها الاجمالية
        {`${numbersToArabic(
          application.installmentsObject?.totalInstallments?.installmentSum
        )} جنيه (${new Tafgeet(
          application.installmentsObject?.totalInstallments?.installmentSum,
          'EGP'
        ).parse()})`}
        بموجب عقد التمويل للمشروعات المتوسطة والصغيرة المؤرخ{' '}
        {timeToArabicDate(application.creationDate, false)}
      </p>
      <p>
        ضماناَ وتأميناً للتسهيلات الائتمانية الممنوحة للمدين والمشار اليه بعاليه
        ، نضمن بالتضامن والتكافل ونقر نحن الموقعين ادناه اقرارا نهائيا غير قابل
        للالغاء او التعديل ونتعهد ونلتزم بما يلى :
      </p>
      <ol>
        <li>
          اقر بأننى قد اطلعت على كافة بنود وشروط عقد التمويل الممنوح من شركة
          تساهيل للتمويل متناهى الصغر وان توقيعى على الكفالة التضامنية بمثابة
          توقيعى على هذا العقد كطرف ثالث كفيل وضامن متضامن لسداد التمويل الممنوح
          من شركة تساهيل للتمويل متناهى الصغر الى شركة{' '}
          {application.customer?.customerName}
        </li>
        <li>
          نلتزم اعتباراً من تاريخ هذه الكفالة ، دون قيد او شرط وبشكل لا رجعة فيه
          ، كملتزم رئيسى بأن نسدد لشركة تساهيل للتمويل متناهى الصغر بناءاً على
          اول طلب له وبغض النظر عن اى اعتراض من جانب اى طرف ثالث
          <ol>
            <li>اى مبالغ غير مسددة من الالتزامات المضمونة او ملحقاتها </li>
            <li>
              سداد كافة المصاريف والرسوم والنفقات ( بما فى ذلك المصاريف
              القانونية ) التى تدفعها شركة تساهيل للتمويل متناهى الصغر لاسترداد
              او محاولة استرداد الالتزامات المضمونة او اى جزء منها من المدين او
              الكفيل المتضامن على اساس التعويض الكلى
            </li>
          </ol>
        </li>
        <li>
          تكون التزامات الكفيل المتضامن بموجب هذه الكفالة اضافة وليس استبدال لأى
          من الضمانات الاخرى التى تحتفظ بها شركة تساهيل للتمويل متناهى الصغر
          حالياً او قد يحتفظ بها فيما بعد بشأن الالتزامات المضمونة او اى جزء
          منها
        </li>
        <li>
          ان التزامات الكفيل المتضامن بموجب ھذه الكفالة لا تسقط ولا تخفض ولا
          تتأثر بأى من الاحوال الاتیة :
          <ol>
            <li>
              افلاس او تصفية او حل او اعادة تنظيم السداد للمدين او اى تغيير فى
              موقف او ادارة او تحكم او ملكية المدين او الكفيل.
            </li>
            <li>
              اذا اصبحت اى من مسئوليات او التزامات المدين او الكفيل او اى طرف
              اخر بموجب اى من الضمانات الاخرى المتعلقة بالالتزامات المضمونة او
              اى جزء منها غير قانونية او باطلة او غير قابلة للتنفيذ بأى حال من
              الاحوال.
            </li>
            <li>
              اية مهلة او فترة سماح اخرى منحت او اتفق على منحها من قبل الشركة
              المدين او الكفيل او اى شخص اخر بشأن اى ضمان اخر.
            </li>
            <li>
              وجود اى اختلاف فى شروط التسهيلات الائتمانية او اى ضمانات اخرى
            </li>
            <li>
              اى اخفاق حالى او لاحق من جانب البنك سواء عن قصد او غير قصد فى
              اتمام الضمانات او تفعيل اتخاذ اجراء بها.
            </li>
            <li>
              اى فعل او حدث او اغفال كان سيؤدى لولا هذه البند الى اسقاط او اضعاف
              او التأثير على التزامات الكفيل بموجب هذه الكفالة
            </li>
          </ol>
        </li>
        <li>
          لن تكون الشركة ملزمه قبل ممارستها اى من حقوقها او سلطاتها او معالجتها
          وفقاً لهذه الكفالة بالاتى :
          <ol>
            <li>ارسال مطالبة للمدين لاستيفاء حقوق الشركة</li>
            <li>
              اتخاذ اى اجراء او الحصول على اى حكم قضائى فى اى محكمة ضد المدين
            </li>
            <li>
              اجراء اى مطالبة او ادعاء وجود حالة افلاس او الحصول على حكم بإفلاس
              او تصفية او حل المدين
            </li>
            <li>
              تنفيذ او محاولة تنفيذ اى من الضمانات الممنوحة للشركة فيما يتعلق
              بالالتزامات المضمونة او اى جزء فيها
            </li>
          </ol>
        </li>
        <li>
          يلتزم الكفيل بسداد جميع المبالغ بموجب هذه الكفالة بنفس العملة الواجب
          على المدين سداداها دون اقتطاع او خصم ما لم يكن ذلك الاقتطاع او الخصم
          مطلوباً بموجب القوانين والانظمة الواجبة التطبيق ، وفى هذه الحالة يتعين
          على الكفيل المتضامن ان يسدد تلك المبالغ الاضافية حسبما تكون لازمة لكى
          يكون صافى المبالغ التى يتسلمها الشركة وفقاً لهذه الكفالة مساوياً
          للمبالغ المعينة المستحقة للشركة قبل الاقتطاع او الخصم.
        </li>
        <li>
          للشركة فقط الحق فى التنازل عن او حوالة الكفاله ولا يجوز للكفيل
          المتضامن حوالة الكفالة او التنازل عنها بدون الموافقة الكتابية المسبقة
          من الشركة
        </li>
        <li>
          - تبقى هذه الكفالة مستمرة ونافذة حتى تمام سداد كافة الالتزامات
          المضمونة وملحقاتها ، كما ان الكفالة لا تتأثر بأى تقصير من جانب المدين
          او الشركة.
        </li>
        <li>
          يجب ان يكون اى تعديل لهذه الكفالة بموافقة الشركة ولا يكون نافذا الا فى
          الحالة بعينها فقط وللغرض المعين الذى اعطى من اجله.
        </li>
        <li>
          نفوض كل كفيل متضامن الشركة بموجب هذه الكفالة فى اجراء الحبس و / او
          المقاصة بين المديونية المستحقة على المدين واية ارصدة دائنة للكفيل
          بالشركة ، وتعتبر تلك الاجراءات نافذة فى حق الكفيل بدون حاجة الى اخطاره
          او انذاره او اتخاذ اى اجراء اخر ضد اى كفيل متضامن اخ
        </li>
        <li>
          التزامات الكفيل المتضامن فى ظل هذه الكفالة (1) لاتخضع لقانونية عقد
          التسهيل أو صحته أو اثره الملزم او قابلية تنفيذه ، و (2) لا تتأثر او
          تخفض بالنظر لأى وقائع او ظروف او احوال ألآ كانت طبيعتها ، فعلية ام
          قانونية
        </li>
        <li>
          يقر الكفيل المتضامن بتنازله عن حقه فى طلب تجريد المدين اولا قبل
          مطالبته بكامل المبلغ المكفول.
        </li>
        <li>
          اذا أصبح اي بند من بنود هذه الكفالة باطلا او مخالفأ للقانون أو غير
          قابل للتنفيذ بأي شكل وبموجب اي قانون , فان ذلك لن يؤثر علي صلاحية
          وقانونية وسريان باقي البنود للتنفيذ
        </li>
        <li>
          يكون اى طلب من قبل الشركة بموجب هذه الكفالة خطياً ويرسل الى عنوان
          الكفيل المذكور ادناه ( او الى اى عنوان اخر يخطر به الكفيل الشركة
          كتابياً من وقت لاخر ) ويعتبر اثره نافذا قانوناً عند ارساله على العنوان
          الموضح بالكفالة.
        </li>
        <li>
          يتعهد الكفيل المتضامن بإخطار الشركة فور ظهور / حدوث اى مؤشرات تفيد
          تعسر او اخلال المدين بالتزاماته تجاه الشركة
        </li>
        <li>
          يتعهد الكفيل المتضامن بالحفاظ على سرية اية معلومات وبيانات خاصة
          بالمدين او التسهيلات او الكفالة وعدم الافصاح عن أى من تلك المعلومات
          لاى طرف ثالث
        </li>
        <li>
          نصرح للشركة بالكشف والحصول على كل او بعض البيانات الخاصة بمعاملات
          الكفيل سواء بشركة تساهيل للتمويل متناهي الصغر او الشركات او البنوك
          الاخرى فى الحال والاستقبال ، كما نصرح لشركة تساهيل للتمويل متناهي
          الصغر او من تفوضه او من ينوب عنها فى الافصاح/ التداول للبيانات الخاصة
          بالكفيل طرف الشركة للكيانات والبنوك والشركات المالكة والتابعة لشركة
          تساهيل وكافة الجهات الرقابية ، ويمتد ذلك التصريح لما يتعلق ببعض
          الخدمات والعمليات المصرفية والتعامل مع مقدميها ( كالخدمات البريدية
          لكشوف الحسابات ، خدمات الصراف الالى والخدمات المصرفية الالكترونية ،
          والاستعلام ، والتصنيف الائتمانى ، الهيئة العامة للاستثمار والمناطق
          الحرة والمدين ... الخ ) وفى حدود ما يتطلب اداء تلك الخدمات لجهات
          التعامل ، وذلك كله بالاضافة الى الحالات المحددة لكشف سرية الحسابات
          وفقا للقانون المصرى .
        </li>
        <li>
          تخضع هذه الكفالة لقوانين جمهورية مصر العربية وتختص المحاكم المصرية بحل
          اى نزاع ينشأ عن هذه الكفالة او فيما يتصل بها ، وبغض النظر عن البند
          اعلاه ، يكون للشركة الحق فى – ولا يجوز منعه من – اتخاذ اى اجراءات فيما
          يتعلق بأى نزاع فى اى اختصاص قضائى آخر.
        </li>
      </ol>
      <p className="font-weight-bolder my-0">الكفيل المتضامن</p>
      <p>الاسم : {person.customerName ?? ''}</p>
      <p>بطاقة الرقم القومى: {person.nationalId ?? ''}</p>
      <p>التاريخ: {timeToArabicDate(application.creationDate, false)}</p>
      <p>العنوان : {person.customerHomeAddress ?? ''}</p>
      <p>التوقيع :</p>
    </div>
  </>
)
