import React, { FC } from 'react'
import './styles.scss'
import add from 'date-fns/add'
import * as local from 'Shared/Assets/ar.json'
import {
  numbersToArabic,
  timeToArabicDate,
  dayToArabic,
  getIndexInArabic,
  getNumbersOfGuarantor,
  getIndexOfGuarantorInAr,
  FLindexLocal,
  periodLengthLocal,
} from 'Shared/Services/utils'

interface Props {
  data: {
    creationDate: number
    customerType: string
    customerName: string
    guarantors: {
      name: string
      address: string
      nationalId: string
    }[]
    vendorName: string
    principal: number
    categoryName: string
    itemDescription: string
    businessSector: string
    downPayment: number
    installmentResponse: number
    periodLength: number
    firstInstallmentDate: number
    lastInstallmentDate: number
    feesSum: number
  }
}

const FinancialLeasingContract: FC<Props> = ({ data }) => {
  const {
    creationDate,
    customerType,
    customerName,
    guarantors,
    vendorName,
    principal,
    categoryName,
    itemDescription,
    businessSector,
    downPayment,
    installmentResponse,
    periodLength,
    firstInstallmentDate,
    lastInstallmentDate,
    feesSum,
  } = data

  const purchaseDate = add(creationDate, {
    days: 7,
  }).valueOf()

  return (
    <div className="financial-leasing-container">
      <div className="head-title">{local.financialLeasingContract}</div>
      <div className="element-title">
        {' '}
        طبقا لاحكام قانون 176 لسنه 2018 بشأن تنظيم نشاط التأجير التمويلي و
        التخصيم
      </div>
      <p>
        أنه في يوم {dayToArabic(2)} الموافق{' '}
        {timeToArabicDate(creationDate, false)} حرر هذا العقد بين كل من :
      </p>
      <div className="d-flex">
        <p>1- شركــــه تساهيل للتمويل متناهى الصغر</p>
        <p className="ml-5"> ( الطرف الأول المؤجر )</p>
      </div>
      <div>مقيده بسجل تجاري رقم 84209 ومقرها : 3 شارع الزهور – المهندسين</div>
      <div>
        ومقيده بسجل المؤجرين التمويلين بالهيئة العامة للرقابة المالية برقم : (
        301 )
      </div>
      <div>
        ويمثلها في التوقيع علي هذا العقد السيد/
        ....................................... بصفته/ رئيس مجلس الأدارة للشركة
      </div>
      <div className="d-flex">
        <p>
          2- {customerType === 'company' ? 'شركة' : 'السيد'} {customerName}
        </p>
        <p className="ml-5"> ( الطرف الثاني المستأجر )</p>
      </div>
      {customerType === 'company' && (
        <>
          <div>
            مقيده بسجل تجاري : ..................................... ومقرها :
            .....................................................
          </div>
          <div>
            الشكل القانوني للطرف الثاني المستأجر( نوع الشركه) :
            ...................................
          </div>
          <div>و النشاط : .........................................</div>
          <div>بطاقة ضريبيه رقم : .................................</div>
          <div>
            ويمثلها في التوقيع علي هذا العقد السيد/ ............................
            بصفته/ .........................
          </div>
        </>
      )}
      {guarantors &&
        guarantors.map((g, index) => (
          <div className="d-flex" key={`${g.name}-${index}`}>
            <p>
              {index + 3}- السيد/ {g.name} المقيم/
              {g.address} بطاقه رقم قومي/
              {numbersToArabic(g.nationalId)}
            </p>
            <p className="ml-5">
              (طرف {FLindexLocal[index + 2]} - ضامن متضامن)
            </p>
          </div>
        ))}
      <div className="element-title">
        بيـــــــــــــــــــان بوصف الأصــــــــــــــــول المؤجرة
      </div>
      <p>
        وافق المؤجر على تأجير الأصول التى يمتلكها أو التى قام بشرائها أو التى له
        الحق فى تأجيرها طبقا للمرفق رقم (1) وللشروط والاحكام الواردة في هذا
        العقد وقانون التأجير التمويلي رقم 176 لسنة 2018.
      </p>
      <div>وبيانها كالأتي:</div>
      <div>اسم المورد / البائع / المقاول : {vendorName || local.na}</div>
      <div>سند ملكيه المؤجر : ( مبايعه من الشركه المورده ) </div>
      <div>الثمن المذكور بسند الملكيه : {numbersToArabic(principal)}</div>
      <div>نوع الاصل المؤجر : {categoryName || local.na}</div>
      <div>وصف الأصل المؤجر : {itemDescription || local.na}</div>
      <div>
        الغرض المخصص لاستخدام الأصل المؤجر : {businessSector || local.na}
      </div>
      <div className="element-title">
        القـــــــــــــــــــيمة الأيــــــــجاريـه
      </div>
      <div>اتفق الأطراف علي أن تكون القيم الأيجارية علي النحو الأتي :</div>
      <div>
        الدفعة المقدمة : {downPayment} جم (فقط
        ........................................ لاغير) اذا تم الاتفاق علي سداد
        مقدمه
      </div>
      <div>
        اجمالي القيمة الايجارية : {numbersToArabic(installmentResponse)} جم (فقط
        ........................................ لاغير) المقدمه + اجمالي الاقساط
      </div>
      <div>تسداد الأجرة بشكل {periodLengthLocal[periodLength] || local.na}</div>
      <div>
        ويبدأ سداد الأجرة من تاريخ{' '}
        {timeToArabicDate(firstInstallmentDate, false)} وتنتهي في{' '}
        {timeToArabicDate(lastInstallmentDate, false)}
      </div>
      <div>
        كما اتفق الأطراف على أن تكون قيمة العوائد و العمولات والمصاريف (أن وجدت)
        علي النحو الأتي :
      </div>
      <div>الفائده : {feesSum}</div>
      <div>.المصاريف الاداريه : ................................</div>

      <div className="element-title">مــدة العقـــــد وثمن الشراء وتاريخة</div>
      <div>
        يبدأ سريان العقد في : {timeToArabicDate(firstInstallmentDate, false)}{' '}
        وينتهي في : {timeToArabicDate(lastInstallmentDate, false)}
      </div>
      <div>وأتفق الأطراف علي أن يكون ثمن شراء الأصل المؤجر: ا. جم </div>
      <div>
        كما اتفق الأطراف على أن يكون تاريخ شراء الأصل المؤجر في موعد أقصاه :{' '}
        {timeToArabicDate(purchaseDate, false)}
      </div>
      <div className="pagebreak" />
      <div className="head-title">تــمهيــــد</div>
      <div>
        حيث أن الطرف الأول ( المؤجر ) يمارس نشاط التأجير التمويلي متناهى الصغر
        وفقا لأحكام قانون التأجير التمويلي والتخصيم رقم 176 لسنة 2018، وقيد بسجل
        قيد المؤجريين التمويليين بالهيئة الهامة للرقابة المالية برقم /301
      </div>
      <div>
        ولما كان المستأجر ( الطرف الثانى ) يمارس نشاط {businessSector} مما يجعله
        يحتاج الى اموال لمزاولة انشطة اقتصادية ( انتاجية – خدمية – تجارية -
        زراعية ) ويرغب أن يقوم بشراء الأصل المؤجر الموضح تفصيلا في صدر هذا العقد
        وملاحقه، وأن يقوم بتأجيرهذا الاصل موضوع العقد إلى الطرف الثاني المستأجر
        وفقا لأحكام هذا العقد واحكام القانون رقم 176 لسنة 2018 والقرارات
        والضوابط الصادرة تنفيذاً لأحكامه. وبعد أن اقر الطرفان بصفتهما وأهليتهما
        لإبرام هذا العقد فقد اتفقا على مايلي{' '}
      </div>
      <div className="law-title">المادة رقم (1)</div>
      <div>
        عتبر التمهيد السابق والملاحق والمرفقات الموقعة من الطرفين المتعاقدين
        جزءا لايتجزأ من هذا العقد .
      </div>
      <div className="law-title">المادة رقم (2)</div>
      <div>
        في حالة قيام المستأجر بالتفاوض مباشرة مع المورد أو المقاول بشأن مواصفات
        الأصل المؤجر فأنه يكون مسئولا عن خطاه في اختيار وتحديد مواصفات الأصل
        المؤجر . ويكون المؤجر مسئولا عن أفعاله أو تصرفاته التي تؤدي الي غلط في
        أختيار الأصل المؤجر أو الي تمكين المورد أو المقاول أو الغير من التعرض
        للمستأجر علي أى وجه في الأنتفاع بالأصول المؤجرة . ويتحمل المستأجر من
        تاريخ استلامه للأصل المؤجر , المسئوليه المدنية والجنائيه عن الحوادث
        والأضرار التي يسببها الأصل المؤجر للغير , كما يتحمل المسئولية عن الحوادث
        والأضرار التي تلحق بالأصل المؤجر الناجمة عن الأستخدام اثناء حيازته له ,
        ولايجوز الرجوع علي المؤجر عن أي أضرار يحدثها الأصل المؤجر طوال مدة سريان
        العقد .
      </div>
      <div className="law-title">المادة رقم (3)</div>
      <div>
        للمســــتأجر الحق في شراء الأصل المؤجر محل التعاقد كله أو بعضـــه وفقا
        للشروط الأتية : - ألا يكون المستأجر قد خالف احكام اى بنود من بنود جميع
        عقود التأجير التمويلى المبرمة مع المؤجر او لم يف بأى من التزاماته
        التعاقدية او القانونية والواردة بأية عقود تأجير تمويلى محرر فيما بينهما
        - يلتزم المستأجر بسائر المصروفات والضرائب والرسوم وخلافه عند عقد البيع
        ولا تنتقل ملكيه الأصل المؤجر الي المستأجر الا بعد قيامة بسداد كامل الثمن
        و القيم الأيجاريه المتفق عليها , و يلتزم المؤجر بتحرير عقد بيع الأصل
        المؤجر الي المستأجر .
      </div>
      <div className="law-title">المادة رقم (4)</div>
      <div className="element-title">يلتزم المستأجر بالأحكام الأتية :</div>
      <div className="rules-container">
        <div>
          يلتزم المستأجر بأن يخطر المؤجر فورا وكتابه بما يطرأ علي المال المستأجر
          من عوارض تحول دون الأنتفاع به كلياً أو جزئيا أثناء سريان العقد وبأي
          حدث أو فعل مادي أو قانوني يمس أو يؤثر علي المال المؤجر بأي شكل من
          الأشكال ,
        </div>
        <div>
          كما يلتزم المستأجر بأن يوفر للمؤجر أيه بيانات ماليه أو فنيه يطلبها
          الأخير تخص المال المؤجر بما في ذلك بيان بحاله المال المؤجر وتقارير
          الخدمه والصيانه و الاستخدام ويراعي أن تكون هذة المعلومات والبيانات
          معده طبقأ للأعراف المحاسبيه والماليه و الفنيه السائده ويتعهد المؤجر
          بأن يكون استخدام تلك البيانات و خصوصيات عمله .
        </div>
        <div>
          أن يؤدي قيمة الأيجار المتفق عليها في العقد وفقا للشروط و المواعيد
          المشار اليها أعلاه .
        </div>
        <div>
          يحظر علي المستأجر التصرف في المال المؤجر محل التعاقد او تحميله أي حق
          من شأنه المساس بملكيه المؤجر للمال أو حقوقه عليه – كما يمتنع عليه
          تأجيره من الباطن أو التنازل عنه الي الغير الا بعد موافقه كتابيه من
          المؤجر – ويجوز للمؤجر أن يطلب من المستأجر بأن يثبت في مكان ظاهر علي
          المال المؤجر اللوحه التي يسلمها له المؤجر والتي تتضمن ملكيته او غير
          ذلك من الحقوق الثابته له كما يلتزم المستأجر بالابقاء علي هذه اللوحه
          مقروءة في مكانها طوال مدة سريان هذا العقد .
        </div>
        <div>
          الاستمرار في أداء قيمه الأيجار أو الثمن المتفق عليه في المواعيد
          المحدده وذلك في حاله هلاك الأصل المؤجر بسبب خطأ المستأجر , و ذلك مع
          مراعاة ما قد يحصل عليه المؤجر من مبالغ التأمين .
        </div>
        <div>
          لا يحق للمستأجر إدخال أية تعديلات على المال محل التعاقد أو على الطريقة
          استخدامه او تشغيله بدون موافقة كتابية من المؤجر وفي هذه الحالة تضاف
          التعديلات إلى أصول دون مقابل ما لم يتم الاتفاق على غير ذلك .
        </div>
        <div>
          تمكين المؤجر أو من يمثله معاينة ومتابعة استعمال المال المؤجر محل
          التعاقد على فترات دورية – يتم الاتفاق عليها بينهما وإذا ثبت للمؤجر
          استعمال المستأجر للمال بالمخالفة للأصول الفنية أو في غير الأغراض
          المتفق عليها فى هذا العقد ،له أن ينذر كتابة بالإلتزام بالأصول الفنية
          وهذه الأغراض وإلا كان له الحق فى طلب الفسخ .
        </div>
        <div>
          يتعهد المستأجر باستعمال وصيانة وحماية وإصلاح المال المؤجر بما يتفق مع
          الأغراض التي أعد لها طبقا للأصول الفنية والمتعارف عليها والتعليمات
          المتعاقد عليها بشأن المواصفات الفنية الواجب مراعاتها ويتحمل مصروفات
          صيانة وحماية المال المؤجر طوال مدة سريان العقد وانه حائز للمال موضوع
          هذا العقد و مسئول عن كافه اوجه صيانته و حفظه و اصلاحه و حراسته
          ومسئوليته عن تبعيه الهلاك الجزئي أو الكلي للمال المؤجر وتحمله
          المسئوليه المدنيه و الجنائيه والتزامه بقيمه أي غرامات او ضرائب او
          مخالفات او رسوم اوعوائد من اي نوع ويعتبر المستأجر وحده مسئولا دون
          المؤجر عن سائر التفقات
        </div>
        <div>
          يعتبر المستأجر مسئولا عن فحص المال المؤجر قبل استلامه و يعتبر بعد فحصه
          عالما العلم الكامل التام النافي لكل جهاله بحاله المال المؤجر ويعتبر
          الأستلام تنازلا من المستأجر عن اي حق في التمسك أو الدفع بالجهل بالعيب
          الظاهر أو الخفي في المال المؤجر كما يعد الاستلام أقرار قطعيا بأن المال
          المؤجر يفي تمام بالغرض الذي تم استئجار المال من اجله وأن يقوم باستخدام
          المال المؤجر وتسليم المال المؤجر الي المستأجر بموجب محضر إستلام مرفق
          رقم (2).
        </div>
        <div>
          يلتزم المستأجر بكافة الضوابط والاحكام الخاصة بقانون مكافحة غسل الاموال
          وتمويل الارهاب ولائحته التنفيذية والقرارات الصادرة تنفيذاً لهما.{' '}
        </div>
        <div>
          يلتزم المستأجر بإستصدار بوليصة تأمين سارية طوال مدة العقد وحتى تاريخ
          استلام او استرداد المؤجر للمال المؤجر من المستأجر كاملاً وسليماً ،
          ويكون هذا التأمين على كامل المال المؤجر شاملاً كافة المخاطر من حريق او
          هلاك جزئى او كلى اياً كان سببه لصالح المؤجر على ان تصدر بوليصة التأمين
          من شركة التأمين مقبولة ولصالح المؤجر وبقيمة تعادل 100 % من قيمة المال
          المؤجر ، ويلتزم المستأجر بتسليم اصل بوليصة التأمين فور اصدارها للمؤجر
        </div>
        <div className="pagebreak" />
        <div>
          يلتزم المستأجر بتفويض المؤجر عن اى اضرار تلحق بالمال محل التعاقد الغير
          مغطاة ببوليصة التأمين ويظل الالتزام بالتعويض قائماً وسارياً فى حالة
          فسخ هذا العقد او انهائه
        </div>
        <div>
          يلتزم المستأجر بعدم الحصول على اى تسهيلات ائتمانية او قروض بضمان المال
          المؤجر سواء من بنوك او اى شركات تأجير تمويلى اخرى .
        </div>
      </div>
      <div className="law-title">المادة رقم (5)</div>
      <div className="element-title">يلتزم المؤجر بالأحكام الأتيه :</div>
      <div className="rules-container">
        <div>
          تسليم الأصـل المؤجر الي المستأجر أو تفويض المستأجر في أستلام الأصل
          وذلك بموجب محضر استلام موقع من المستأجر والمنتج أو المورد أو المقاول و
          يثبت فيه حالة الأصـــل المؤجر ومال به من عيوب أن وجدت وكافه البيانات
          الخاصة به وحالته وقت الأستلام , وفي هذه الحالة يكون المستأجر مسئولا
          قبل المؤجر عن أيه بيانات عن الأصل يتضمنها محضر الأستلام .
        </div>
        <div>
          عدم التعرض للمستأجر في حيازته للأصـل المؤجر أو تمكين المنتج أو المورد
          أو المقاول أو الغير من التعرض للمستأجر فى حيازته و يكون المؤجر مسئولا
          عن افعاله او تصـــــرفاته التي تحول دون انتفاع المستأجر بالأصل المؤجر
          .
        </div>
        <div>
          اخطار المستأجر بالجهات التي يتم التنازل أو حواله الحقوق الناشئه عن
          العقد اليها .
        </div>
        <div>
          الحفاظ علي السريه التامه لبيانات المستأجر وعدم افشاء أيه معلومات عنهم
          أو عن معاملاته الي الغير بدون موافقته الكتابيه المسبقة وفي حدود هذه
          الموافقة , ويستثني من ذلك الحالات التي تطلب فيها هيئة الرقابة المالية
          أي بيانات أو مستندات متعلقة بعقد التأجير التمويلي أو لها علاقة بالعقد
          , كما يستثني ايضا الجهات الرقابية أو القضائية أو شركات التصنيف أو
          الاستعلامي الأئتماني و الجهات التي تباشر نشاط التوريق أو اعاده التمويل
          و ذلك وفقا لما تفرضه القوانين .
        </div>
      </div>
      <div className="law-title">المادة رقم (6)</div>
      <div>
        يقوم المؤجر باثبات صفته علي الأصل المؤجر ورقم وتاريخ قيد العقد في سجل
        قيد العقود بالهيئة , علي أن يكون البيان واضــــــحا وفي مكان ظاهرا ,
        ولايجوز للمستأجر اخفاء او طمث هذا البيان طوال مدة سريان العقد .
      </div>
      <div>
        ويكون للمؤجر أو من ينوب عنه الحق في معاينة الأصل المؤجر دوريا للتأكيد من
        سلامته و استعماله في الغرض المخصص له مرة كل
        ........................................................( شهر / ربع سنه
        / نصف سنه / سنه ).
      </div>
      <div className="law-title">المادة رقم (7)</div>
      <div>
        للمؤجر أن يتنازل عن عقد التأجير التمويلي ألي مؤجر أخر , ولايسري هذا
        التنازل في حق المستأجر الا من تاريخ أخطاره به , ولايترتب علي هذا التنازل
        أي أخلال بالحقوق و الضمانات المقرره للمستأجر بموجب العقد .
      </div>
      <div>
        كما يكون للمؤجر أيضا أحاله كل أو بعض حقوقها المالية الناشئه عن عقد
        التأجير التمويلي الي مؤجر أخر أو جهة أخري تمارس نفس النشاط أو الي أحد
        البنوك المحلية المسجله لدي البنك المركزي المصــري أو لاحدي الجهات المرخص
        لها بممارسه نشاط التوريق .
      </div>
      <div>
        كما يجوز للمستأجر بعد الحصول على موافقة كتابية من المؤجر، التنازل عن عن
        عقد التأجير التمويلي والتخصيم رقم 176 لسنة 2018 .
      </div>
      <div className="law-title">المادة رقم (8)</div>
      <div className="element-title">
        يعد عقد التأجير التمويلي مفسوخا من تلقاء نفسه دون حاجة الي اعذار أو
        اتخاذ اجراءات قضائيه في أي من الحالات الأتيه :
      </div>
      <div>
        1- عدم قيام المستأجر بسداد قيمة الأيجار المتفق عليها في المواعيد وفقا
        للشروط المتفق عليها في العقد رغم قيام المؤجر بالتنبيه عليه بالسداد , و
        مرور ثلاثون يومأ علي فوات هذه المواعيد , ما لم يتفق أطراف العقد علي خلاف
        ذلك .
      </div>
      <div>
        2- وفاة المستأجر أو الشريك المتضامن في شركه الأشخاص المستأجرة ما لم يطلب
        الورثه أو الشريك المتضامن الجديد استكمال تنفيذ العقد خلال ثلاثين يوما من
        تاريخ الوفاه .
      </div>
      <div>
        3- أشهار افلاس المستأجر أو اعلان اعساره , أو انقضاء الشركه المستأجرة
        بأحد الأسباب المقررة قانونا لانقضاء الشركات , ومع ذلك يجوز لامين
        التفليسه أو المصفي أن يخطر المؤجر بكتاب مسجل خلال ثلاثين يوما من تاريخ
        الحكم الصادر باشهار الافلاس أو اعلان اعساره أو انقضاء الشركه برغبته في
        استمرار العقد , وفي هذة الحاله يستمر العقد قائما بشروط عدم الاخلال بحقوق
        المؤجر المنصوص عليها في العقد وبخاصه أداء قيمه الايجار في مواعيدها .
      </div>
      <div>
        4- كما اتفق الأطراف علي فسخ العقد في حالة عدم وفاء المستأجر بأي من
        التزماته التعاقدية او القانونية الواردة في هذا العقد وملحقاته ومرفقاته
        وكذا التزاماته الواردة في اية عقود تأجير تمويلي اخرى ( ان وجد ) الموقعة
        بينه وبين المؤجر او القوانين السارية في اى وقت من الاوقات يعد مخفقا في
        الوفاء بالتزاماته التعاقدية ويعتبر كافة عقود التأجير المحررة فيما بينهما
        مفسوخاه من تلقاء نفسها دون حاجة الى اعذار او اتخاذ اجراءات قضائية ومن
        حالات الاخفاق على سبيل المثال لا الحصر:{' '}
      </div>
      <div>
        ا- عدم الوفاء بالاجرة او اية مبالغ اخرى مستحقة طبقا لهذا العقد او اية
        عقود اخرى او اعمالا لنصوصه لمدة تزيد على ثلاثون يوما من التاريخ الواجب
        فيه الاداء.
      </div>
      <div>
        ب- اتخاذ اجراءات التصفية قبل المستأجر سواء كانت اجبارية او اختيارية
      </div>
      <div>
        ج- عدم وفاء المستأجر بأى من التزاماته التعاقدية او القانونية طبقا لهذا
        العقد او اية عقود اخرى وفي حالة عدم سداده لاى دين من الديون المستحقة.{' '}
      </div>
      <div>
        د- قيام المستأجر بتقديم اية بيانات او معلومات مخالفة للواقع او غير سليمة
        وذلك الى المؤجر.
      </div>
      <div>
        ه- حالة تعذر وفاء المستأجر بأي من التزاماته التعاقدية قبل المؤجر او
        استحالة تنفيذ اية ضمانه من الضمانات التى قدمها المستأجر للمؤجر او زوال
        تلك الضمانة.
      </div>
      <div>
        و- حالة اندماج المستأجر في شركة او كيان اخر او حله او حوالة او بيع اسهم
        المساهمين فيه حاليا الى الغير دون الحصول على الموافقة الكتابية المسبقة
        الصريحة من المؤجر او البيع او التصرف في اصل جوهري من اصوله الائمة وقت
        التوقيع على هذا العقد او توقف اعمال المستأجر لاي سبب من الاسباب.
      </div>
      <div className="pagebreak" />
      <div>
        ز- حالة اندماج المستأجر في شركة او كيان اخر او حله او حوالة او بيع اسهم
        المساهمين فيه حاليا الى الغير دون الحصول على الموافقة الكتابية المسبقة
        الصريحة من المؤجر او البيع او التصرف في اصل جوهري من اصوله الائمة وقت
        التوقيع على هذا العقد او توقف اعمال المستأجر لاي سبب من الاسباب.
      </div>
      <div>
        ح- وفاه المستأجر او الشريك المتضامن في شركة الاشخاص ما لم يطلب الورثة او
        الشريك المتضامن الجديد استكمال تنفيذ العقد خلال ثلاثون يوما من تاريخ
        الوفاة.{' '}
      </div>
      <div>
        ط- في حالة اهمال المستأجر في الحفاظ على اى من الاموال المؤجره موضوع
        التأجير التمويلي فيما بينهما وذلك سواء عن عمد او اهمال.
      </div>
      <div className="element-title">
        كما يكون للمؤجر في حالة قيام حالة من الحالات السابقة الاتي:{' '}
      </div>
      <div>
        1- يعتبر اى مبلغ يستحق للمؤجر طبقا لهذا العقد واية عقود تأجير تمويلي
        محررة فيما بينهما دينا تجاريا في ذمة المستأجر.
      </div>
      <div>
        2- تصير القيمة الحالية للاقساط المتبقية لجميع عقود التأجير التمويلي
        المحررة فيما بينهما بالاضافة الى كافة الفوائد والعمولات الخاصة بالتأخير
        حالة ومستحقة وواجبة الاداء فورا كتعويض جزئي اتفاقي محدد لا يخضع لرقابة
        القضاء ولا يعفي المستأجر من السداد الا في حالة بيع الاموال المؤجرة لجميع
        عقود التأجير التمويلي المحررة المؤجر وجبر ثمن البيع للقيمة الحالية
        للاقساط المتبقية بالاضافة الى الفوائد والعمولات الخاصة بالتأخير حتى
        نهاية مدة هذه العقود ويحق للمؤجر الحصول على الفارق من المستأجر ولا يحق
        للمستأجر الطعن او المعارضة في ذلك او التظلم بأية وسيلة او طريقة عرفية او
        رسمية ودية او قضائية.
      </div>
      <div>
        3- يكون للمؤجر استصدار امر حجز تحفظي على الاموال المؤجرة موضوع هذا العقد
        او اية عقود تأجير تمويلي اخرى محررة فيما بينهما تحت اى يد تكون واستصدار
        امر بمطلوب المؤجر.
      </div>
      <div>
        4- يحل التزام المستأجر فورا برد الاموال المؤجرة طبقا لهذا العقد الى
        المؤجر والا اعتبر يد المستأجر على المال المؤجر يد غاضبه دونما حاجة الى
        اعذاره او اخطاره ويبيح المستأجر للمؤجر ومن الان وفي حالة عدم رد الاموال
        رضاء تتبع الاموال المؤجرة وحيازتها والسيطرة عليها دونما حاجة الى امر او
        حكم وللمؤجر اذا رغب في ذلك اللجوء الى قاضي الامور الوقتية بالمحكمة
        المختصة لاستصدار امر التسليم.
      </div>
      <div>
        5- يتحمل المستأجر بأية تعويضات اخرى مستحقة ويكون دين المؤجر دينا ممتازا
        ويجوز للمؤجر ان يبيع المال المؤجر او يؤجره فورا الى الغير دونما اية حاجة
        الى اخطار المستأجر مسبقا بذلك.
      </div>
      <div>
        6- يجوز للمؤجر بعد اعذار المستأجر واستمرار عدم وفاء الاخير بأية التزام
        وارد عليه بموجب هذا العقد او اية عقود تأجير تمويلي اخرى محررة فيما
        بينهما لمدة اسبوعين في استرداد الاموال المؤجرة فورا والحصول على تعويض
        الكامل من المستأجر.
      </div>
      <div className="element-title">فسخ العقد بسبب هلاك المال المؤجر:</div>
      <div>
        يعتبر العقد مفسوخا بقوة القانون اذا هلك االمال المؤجر هلاكا كليا واذا
        كان الهلاك راجعا الى خطأ المستأجر التزم بالاستمرار في اداء القيمة
        الايجارية او الثمن المتفق عليه في المواعيد المحددة وذلك مع مراعاة ما قد
        يحصل عليه المؤجر من مبالغ التأمين وذلك في حالة عدم كفاية التأمين لسداد
        باقي الاقساط.
      </div>
      <div>
        اما اذا كان الهلاك راجعا الى خطأ الغير كان المؤجر الحصول فورا على كامل
        قيمة الاجرة غير المسددة المستحقة حتي نهاية مدة هذا العقد من المستأجر او
        من شركة التأمين وللمستأجر الرجوع على الغير بالتعويض.
      </div>
      <div>
        وفي حالة تسليم المال المؤجر لشركة التأمين للحصول على قيمة التأمين عند
        الهلاك الكلي يعتبر ذلك تنازلا لا رجعة فيه من المستأجر عن حق شراء المال
        المؤجر الوارد بالمادة (21) من هذا العقد كا يعتبر توقيع المستأجر على هذا
        العقد تفويضا منه للمؤجر في هذه الحالة لالغاء عقد التأجير التمويلي لدى
        هيئة الرقابة المالية.
      </div>
      <div className="element-title">التأمين علي المال المؤجر:</div>
      <div>
        اتفق الاطراف علي التأمين علي المال المؤجر طبقا للشروط والمواصفات
        التالية:
      </div>
      <div>
        يلتزم المستأجر وعلي نفقته بإستصدار بوليصة تأمين سارية طوال مدة هذا العقد
        وحتي تاريخ استلام واسترداد المؤجر المال المؤجر من المستأجر او كاملا
        وسليما تماما علي ان تصدر بوليصة التأمين من شركة تأمين مقبولة للمؤجر
        وبقيمة تعادل 100% من قيمة المال المؤجر وتغطي البوليصة سائر المخاطر ومن
        ذلك علي سبيل المثال لا الحصر هلاك او تلف كامل المال او اجزاءه ومشتملاته
        والمسئولية عن الاضرار الناشئة عن استخدام او سوء استخدام المال كما يلتزم
        المستأجر بتأمين المؤجر ضد سائر المسؤليات او المخاطر التي تنشأ عن استخدام
        او سوء استخدام المال كما يلتزم المستأجر بالتأمين علي المال المؤجر ضد
        مخاطر السرقة او الإتلاف او الحريق وعامة ضد سائر مخاطر الهلاك الكلي او
        الجزئي للمال المؤجر ايا كان سببه علي ان يكون المؤجر المستفيد الوحيد من
        البوالص في حالات الإتلاف او الحريق او الهلاك الكلي او الجزئي.
      </div>
      <div>
        كما يلتزم المستأجر بأن يسلم للمؤجر بوالص التأمين سالفة الذكر فور
        استصدارها او تجديدها.
      </div>
      <div>
        وفي حالة عدم التزام المستأجر بالوفاء بكل ما ذكر اعلاه يحق للطرف الاول
        (المؤجر) إبرام و/أو تجديد وثيقة التأمين علي المال المؤجر بأسم الطرف
        الثاني (المستأجر) ولصالح الطرف الاول (المؤجر) لتغطي كافة الاخطار
        المذكورة اعلاه وذلك علي نفقة الطرف الثاني (المستأجر) ودون الرجوع إليه في
        هذا الخصوص، علي ان تضاف تكلفة التأمين علي حساب الطرف الثاني لدي الطرف
        الاول (المؤجر) مع إلتزام الطرف الثاني بسدادها فورا.
      </div>
      <div>
        كما يلتزم المستأجر بكافة مبالغ الاصلاح التي تخرج عن نطاق التغطية
        التأمينية للوثيقة او الوثائق وكذا كافة مبالغ التحمل الواردة بالوثيقة او
        الوثائق والتي تخصم من قيمة التعويضات المستحقة، كما يلتزم المستأجر بكامل
        قيمة التلفيات في حالة رفض المطالبة المقدمة لشركة التأمين اذا كان سبب
        الرفض يرجع الي او بسبب اي من البيانات المقدمة منه.
      </div>
      <div>
        {' '}
        ويتم التأشير بالفسخ بسجل قيد عقود التأجير التمويلي وفقا للأجراءات
        المقررة بهذا الشأن , وفي جميع الأحوال لا يدخل الأصل الؤجر في الضمان
        العام للدائنين .
      </div>
      <div className="law-title">المادة رقم (9)</div>
      <div>
        تختص المحاكم الاقتصاديه بنظر كافه المنازعات التي تنشأ نتيجه الاخلال بأي
        بند من بنود هذا العقد بما فيها منازعات التنفيذ الوقتية والموضوعية{' '}
      </div>
      <div className="pagebreak" />
      <div className="element-title">
        ويستبدل بالنص التالي عند الأتفاق علي التحكيم
      </div>
      <div>
        يكون الاختصاص لهيئات التحكيم بالفصل في المنازعات الناشئه بين أطراف هذا
        العقد.
      </div>
      <div>
        اتفق الطرفين علي ان للطرف الاول إختيار جهة الاختصاص لنظر المنازعات سواء
        امام القضاء او التحكيم.
      </div>
      <div className="law-title">المادة رقم (10)</div>
      <div>
        يقر أطراف العقد باتخاذهم محلا مختارا لهم بالعنوان الموضح لكل منهم بصدر
        هذا الاتفاق ويلتزم كل من المؤجر و المستأجر باخطار الأخر في حاله تغييره
        بخطاب موصي عليه بعلم الوصــــــول , والأ اعتبرت جميع الأعلانات و
        المراسلات التي تمت علي هذا العنوان صحيحه ومنتجه لاثارها القانونية .
      </div>
      <div className="law-title">المادة رقم (11)</div>
      <div>
        تحـــــرر هذا الاتفاق من ثلاثه نسخ بيد كل طرف نسخه للعمل بمقتضاها عند
        اللزوم و النسخه الثالثه يتم استخدامها في قيد عقد التأجير التمويلي بالسجل
        المخصص لهذا الغرض بالهيئه العامه للرقابه المالية .
      </div>
      <div className="law-title">التوقيع </div>
      <footer className="border-top">
        <div className="d-flex justify-content-around mb-5">
          <p>الطرف أول مؤجر</p>
          <p>الطرف الثاني المستأجر</p>
        </div>
      </footer>
    </div>
  )
}

export default FinancialLeasingContract
